return {
  "folke/snacks.nvim",
  priority = 1000,
  lazy = false,
  opts = {
    notifier = { enabled = true },
    indent = { enabled = true },
    toggle = { enabled = true },
    terminal = {
      win = {
        position = "float",
        border = "rounded",
        width = 0.7,
        height = 0.7,
      },
    },
    dashboard = {
      sections = {
        { section = "header" },
        { icon = " ", title = "Keymaps", section = "keys", indent = 2, padding = 1 },
        { icon = " ", title = "Recent Files", section = "recent_files", indent = 2, padding = 1 },
        { icon = " ", title = "Projects", section = "projects", indent = 2, padding = 1 },
        { section = "startup" },
      },
      preset = {
        header = [[
       ░░░░░░       ░░░░░░      ░░░░░░░                ░░░░░░░  
  ░░░░░░░███░░      ░░██░░░    ░░░▒▒▒░░░              ░░░███░░░ 
 ░░▒▒░░░█████░░     ░░████░░░ ░░░▒▒▒▒▒▒░░░           ░░░█████░░░
 ░░▒▒▒▒░░█████░░    ░░██████░░ ░░░▒▒▒▒▒▒░░░         ░░░█████░░░ 
 ░░▒▒▒▒▒▒░█████░░   ░░██████░░  ░░░▒▒▒▒▒▒░░░       ░░░█████░░░  
 ░░▒▒▒▒▒▒░░█████░░  ░░██████░░   ░░░▒▒▒▒▒▒░░░     ░░░█████░░░   
 ░░▒▒▒▒▒▒░░░█████░░ ░░██████░░    ░░░▒▒▒▒▒▒░░░   ░░░█████░░░    
 ░░▒▒▒▒▒▒░░░░█████░░░░██████░░     ░░░▒▒▒▒▒▒░░░ ░░░█████░░░     
 ░░▒▒▒▒▒▒░░ ░░█████░░░██████░░      ░░░▒▒▒▒▒▒░░░░░█████░░░      
 ░░▒▒▒▒▒▒░░  ░░█████░░██████░░       ░░░▒▒▒▒▒▒░░░█████░░░       
 ░░▒▒▒▒▒▒░░   ░░█████░██████░░        ░░░▒▒▒▒▒▒░█████░░░        
 ░░▒▒▒▒▒▒░░    ░░█████░░████░░         ░░░▒▒▒▒▒▒░███░░░         
 ░░░░▒▒▒▒░░     ░░█████░░░██░░          ░░░▒▒▒▒▒▒░░░░           
   ░░░░▒▒░░      ░░███░░░░░░░            ░░░▒▒▒░░░░             
     ░░░░░░       ░░░░░░                  ░░░░░░░               
]],
        keys = {
          { icon = " ", key = "ff", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
          { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
          { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
          { icon = " ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
          {
            icon = " ",
            key = "c",
            desc = "Config",
            action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
          },
          { icon = " ", key = "s", desc = "Restore Session", action = ":lua require('persistence').load()" },
          { icon = "󰒲 ", key = "l", desc = "Lazy", action = ":Lazy" },
          { icon = " ", key = "q", desc = "Quit", action = ":qa" },
        },
      },
    },
  },
}
